In [1]:
import pandas as pd

### list to DF

In [12]:

my_list = [['Alice', 25], ['Bob', 30], ['Charlie', 28]]
# list_df = pd.DataFrame(my_list)  
# list_df

#  rename column name
list_df = pd.DataFrame(my_list, columns=['Name', 'Age'], index=[1,2,3]) 
list_df

      Name  Age
1    Alice   25
2      Bob   30
3  Charlie   28

### tuple to DF

In [13]:
my_tup = (('Alice', 25), ('Bob', 30),('Charlie', 28))
# tup_df = pd.DataFrame(my_tup)  
# tup_df

#  rename column name
tup_df = pd.DataFrame(my_tup, columns=['Name', 'Age'], index=[1,2,3]) 
tup_df

      Name  Age
1    Alice   25
2      Bob   30
3  Charlie   28

## dic to df

In [15]:

my_dict = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 29,28]
}

dict_df = pd.DataFrame(my_dict)

dict_df

      Name  Age
0    Alice   25
1      Bob   29
2  Charlie   28

## list-dic to df

In [17]:

my_data = [
    {'Name': 'Alice', 
     'Age': 25, 
     'City': 'New York'
    },
    {'Name': 'Bob', 
     'Age': 30, 
     'City': 'Paris'
     },
    {'Name': 'Charlie',
     'Age': 28
     }
]

data_df = pd.DataFrame(my_data) 

data_df

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   28       NaN